---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Selection.ISelectionFilter
source: html/611bf241-1ae1-ca12-2d46-5b3b17122612.htm
---
# ISelectionFilter Members

Override this pre-filter method to specify if the element should be permitted to be selected.